




function arrayRand(arr) {
    var rand = Math.floor(Math.random() * arr.length);
    return arr[rand];
}

function randomInteger(min, max) {
  // случайное число от min до (max+1)
  let rand = min + Math.random() * (max + 1 - min);
  return Math.floor(rand);
}

function openCity(evt, cityName) {
    // Declare all variables
    var i, tabcontent, tablinks;

    // Get all elements with class="tabcontent" and hide them
    tabcontent = document.getElementsByClassName("tabcontent");
    for (i = 0; i < tabcontent.length; i++) {
        tabcontent[i].style.display = "none";
    }

    // Get all elements with class="tablinks" and remove the class "active"
    tablinks = document.getElementsByClassName("tablinks");
    for (i = 0; i < tablinks.length; i++) {
        tablinks[i].className = tablinks[i].className.replace(" active", "");
    }

    // Show the current tab, and add an "active" class to the button that opened the tab
    document.getElementById(cityName).style.display = "block";
    evt.currentTarget.className += " active";
}


function npcgen() {
$('.npcgen').empty()
let m = ''
let x=''
let l = ''
let kach =[]
let gun_corps=["ЛЕтс-ГО","Армада","European Guns"]
let gun_list=["Пистолет","Дробовик","Винтовка","Автомат","Гранатомет","Пулемет","Шокер","Шприцемет"]
let mellee_list=["Нож","Катана","Бита","Дилдо"]
let sus=["год","человек","время","дело","жизнь","день","рука","раз","работа","слово","место","лицо","друг","глаз","вопрос","дом","сторона","страна","мир","случай","голова","ребенок","сила","конец","вид","система","часть","город","отношение","женщина","деньги","земля","машина","вода","отец","проблема","час","право","нога","решение","дверь","образ","история","власть","закон","война","бог","голос","тысяча","книга","возможность","результат","ночь","стол","имя","область","статья","число","компания","народ","жена","группа","развитие","процесс","суд","условие","средство","начало","свет","пора","путь","душа","уровень","форма","связь","минута","улица","вечер","качество","мысль","дорога","мать","действие","месяц","государство","язык","любовь","взгляд","мама","век","школа","цель","общество","деятельность","организация","президент","комната","порядок","момент","театр","письмо","утро","помощь","ситуация","роль","рубль","смысл","состояние","квартира","орган","внимание","тело","труд","сын","мера","смерть","рынок","программа","задача","предприятие","окно","разговор","правительство","семья","производство","информация","положение","центр","ответ","муж","автор","стена","интерес","федерация","правило","управление","мужчина","идея","партия","совет","счет","сердце","движение","вещь","материал","неделя","чувство","глава","наука","ряд","газета","причина","плечо","цена","план","речь","точка","основа","товарищ","культура","данные","мнение","документ","институт","ход","проект","встреча","директор","срок","палец","опыт","служба","судьба","девушка","очередь","лес","состав","член","количество","событие","объект","зал","создание","значение","период","шаг","брат","искусство","структура","номер","пример","исследование","гражданин","игра","начальник","рост","тема","принцип","метод","тип","фильм","край","гость","воздух","характер","борьба","использование","размер","образование","мальчик","кровь","район","небо","армия","класс","представитель","участие","девочка","политика","герой","картина","доллар","спина","территория","пол","поле","изменение","направление","рисунок","течение","церковь","банк","сцена","население","большинство","музыка","правда","свобода","память","команда","союз","врач","договор","дерево","факт","хозяин","природа","угол","телефон","позиция","двор","писатель","самолет","объем","род","солнце","вера","берег","спектакль","фирма","способ","завод","цвет","журнал","руководитель","специалист","оценка","регион","песня","процент","родитель","море","требование","основание","половина","роман","круг","анализ","стихи","автомобиль","экономика","литература","бумага","поэт","степень","господин","надежда","предмет","вариант","министр","граница","дух","модель","операция","пара","сон","название","ум","повод","старик","миллион","успех","счастье","ребята","кабинет","магазин","пространство","выход","удар","база","знание","текст","защита","руководство","площадь","сознание","возраст","участник","участок","пункт","линия","желание","папа","доктор","губа","дочь","среда","председатель","представление","солдат","художник","волос","оружие","соответствие","ветер","парень","зрение","генерал","огонь","понятие","строительство","ухо","грудь","нос","страх","услуга","содержание","радость","безопасность","продукт","комплекс","бизнес","сад","сотрудник","лето","курс","предложение","рот","технология","реформа","отсутствие","собака","камень","будущее","рассказ","контроль","река","продукция","сумма","техника","здание","сфера","необходимость","фонд","подготовка","лист","республика","хозяйство","воля","бюджет","снег","деревня","мужик","элемент","обстоятельство","немец","победа","источник","звезда","выбор","масса","итог","сестра","практика","проведение","карман","слава","кухня","определение","функция","войско","комиссия","применение","капитан","работник","обеспечение","офицер","фамилия","предел","выборы","ученый","бутылка","бой","теория","зона","отдел","зуб","разработка","личность","гора","товар","метр","праздник","влияние","читатель","удовольствие","актер","слеза","ответственность","учитель","акт","боль","множество","особенность","показатель","корабль","звук","впечатление","частность","детство","вывод","профессор","доля","норма","прошлое","командир","коридор","поддержка","рамка","враг","этап","черт","дед","собрание","прием","болезнь","клетка","кожа","заявление","попытка","сравнение","расчет","депутат","комитет","знак","дядя","учет","хлеб","чай","режим","целое","вирус","выражение","здоровье","зима","десяток","глубина","сеть","студент","секунда","скорость","поиск","суть","налог","ошибка","доход","режиссер","поверхность","ощущение","карта","клуб","станция","революция","колено","министерство","стекло","этаж","высота","бабушка","трубка","газ","мастер","поведение","столица","механизм","передача","способность","подход","энергия","существование","исполнение","кино","сожаление","заместитель","ресурс","акция","рождение","администрация","стоимость","улыбка","артист","сосед","фраза","фигура","субъект","реакция","список","фотография","журналист","май","нарушение","заседание","толпа","больница","существо","свойство","долг","поколение","животное","схема","усилие","отличие","остров","противник","волна","реализация","страница","формирование","житель","красота","птица","растение","тень","явление","храм","запах","водка","наличие","ужас","одежда","кресло","больной","поезд","университет","традиция","адрес","декабрь","ладонь","сведение","цветок","лидер","октябрь","занятие","сентябрь","помещение","январь","зритель","редакция","стиль","весна","фактор","август","известие","зависимость","охрана","оборудование","концерт","отделение","расход","выставка","милиция","переход","эпоха","запад","произведение","родина","собственность","тайна","трава","лагерь","имущество","кровать","аппарат","середина","март","клиент","дама","фронт","отрасль","стул","беседа","законодательство","продажа","повышение","музей","след","полковник","сомнение","понимание","апрель","князь","рыба","дума","кодекс","сутки","чудо","шея","судья","крыша","настроение","поток","должность","преступление","мозг","честь","пост","еврей","июнь","сотня","дождь","лестница","дача","установка","появление","получение","образец","труба","главное","осень","костюм","баба","ценность","обязанность","пьеса","таблица","вино","воспоминание","лошадь","коллега","организм","ученик","учреждение","открытие","том","черта","характеристика","выполнение","оборона","выступление","температура","перспектива","подруга","приказ","жертва","ресторан","километр","спор","вкус","признак","промышленность","американец","лоб","заключение","восток","исключение","ключ","постановление","слой","бок","июль","перевод","секретарь","кусок","слух","польза","звонок","обстановка","чиновник","соглашение","деталь","русский","тишина","зарплата","билет","подарок","тюрьма","ящик","конкурс","книжка","изучение","просьба","царь","публика","смех","сообщение","угроза","беда","блок","достижение","назначение","реклама","портрет","масло","стакан","урок","часы","крик","творчество","телевизор","инструмент","концепция","лейтенант","экран","дно","реальность","канал","мясо","знакомый","щека","конфликт","переговоры","запись","вагон","площадка","последствие","сотрудничество","зеркало","тон","академия","палата","потребность","ноябрь","увеличение","дурак","поездка","обед","потеря","февраль","мероприятие","парк","принятие","устройство","вещество","категория","сезон","гостиница","издание","объединение","темнота","человечество","колесо","опасность","разрешение","воздействие","коллектив","камера","запас","следствие","длина","крыло","округ","фон","кандидат","родственник","давление","присутствие","взаимодействие","доска","партнер","двигатель","шум","достоинство","грех","нож","полет","страсть","испытание","TRUE","оплата","разница","водитель","пакет","снижение","формула","живот","капитал","мост","новость","эффект","вход","губернатор","доклад","смена","убийство","эксперт","автобус","платье","кадр","тетя","общение","психология","лев","порог","проверка","процедура","рабочий","ремонт","обращение","обучение","ожидание","памятник","корень","наблюдение","буква","доказательство","признание","постель","штаб","владелец","компьютер","инженер","старуха","лодка","ракета","серия","шутка","вершина","выпуск","кулак","лед","торговля","нефть","молодежь","цифра","корпус","недостаток","сапог","сущность","талант","эффективность","кофе","полоса","основное","рассмотрение","сбор","штат","следователь","жилье","мешок","описание","куст","отказ","замок","редактор","дворец","забота","пиво","диван","столик","эксперимент","печать","кольцо","пистолет","воспитание","начальство","профессия","ворота","добро","дружба","покой","риск","окончание","дым","брак","величина","записка","инициатива","совесть","активность","кость","спорт","кредит","господь","майор","конференция","потолок","библиотека","помощник","конструкция","отдых","ручка","металл","молоко","прокурор","транспорт","поэзия","соединение","краска","расстояние","мечта","село","еда","зло","подразделение","сюжет","рубеж","сигнал","атмосфера","крест","вес","взрыв","контакт","сигарета","восторг","золото","почва","премия","король","подъезд","шанс","автомат","заказ","мальчишка","очки","миг","штука","чтение","поселок","свидетель","ставка","сумка","удивление","хвост","песок","поворот","возвращение","мгновение","статус","озеро","строй","параметр","сказка","тенденция","вина","дыхание","версия","масштаб","монастырь","хозяйка","дочка","танец","эксплуатация","коммунист","пенсия","приятель","объяснение","набор","производитель","пыль","философия","мощность","обязательство","уход","горло","кризис","указание","плата","яблоко","препарат","действительность","москвич","остаток","изображение","сделка","сочинение","покупатель","танк","затрата","строка","единица","обработка","чемпионат"]
let pril=["абсолютный","адский","азартный","активный","ангельский","антагонистический","арктический","астрономический","баснословный","безапелляционный","безбожный","безбрежный","безвозвратный","безграничный","бездонный","бездушный","безжалостный","беззаветный","беззастенчивый","безмерный","безмятежный","безнадежный","безоговорочный","безотлагательный","безраздельный","безрассудный","безропотный","безудержный","безукоризненный","безумный","безупречный","безусловный","безустанный","безутешный","безысходный","белоснежный","бескомпромиссный","бесконечный","беспардонный","бесповоротный","беспощадный","беспредельный","беспрекословный","беспрецедентный","беспримерный","беспробудный","беспроглядный","беспросветный","беспросыпный","бессовестный","бесстыдный","бесценный","бесчеловечный","бесчисленный","бесшабашный","бешеный","блестящий","богатый","богатырский","большой","буйный","бурный","варварский","великий","величайший","веский","весомый","внушительный","возмутительный","волчий","вопиющий","восторженный","впечатляющий","всемерный","всепоглощающий","всесильный","всесторонний","всяческий","выдающийся","вылитый","высокий","высший","галопирующий","гибельный","гигантский","глубокий","глубочайший","глухой","головокружительный","гомерический","горький","горючий","горячий","грандиозный","гробовой","грозный","громадный","громкий","громоподобный","грубый","густой","диаметральный","дивный","дикий","добрый","доскональный","дотошный","дремучий","душераздирающий","дьявольский","жаркий","жгучий","железный","жесткий","жестокий","жесточайший","живой","животный","жизненный","жуткий","завзятый","завидный","закадычный","заклятый","законченный","закоренелый","замечательно","замечательный","записной","запредельный","заядлый","звериный","зверский","зеленый","злой","злостный","значительный","идеальный","излишний","изрядный","изуверский","изумительный","исключительный","исполинский","исступленный","истинно","истинный","истовый","истошный","исчерпывающий","каменный","кардинальный","катастрофический","категорический","клятвенный","колоссальный","коренной","космический","крайний","крепкий","кристальный","кричащий","кровный","кромешный","круглый","крупный","крутой","леденящий","лошадиный","лютый","максимальный","массовый","маститый","матерый","махровый","мертвенный","мертвецкий","мертвый","мировой","могильный","могучий","молниеносный","мощный","мучительный","набитый","наглый","наглядный","надежный","надрывный","наибольший","наивысший","нарочитый","настоятельный","настоящий","насущный","небывалый","невероятный","невиданный","невозможный","невообразимый","невосполнимый","невыносимый","невыразимый","недопустимый","недосягаемый","недюжинный","незабываемый","незаурядный","неземной","неизбывный","неизмеримый","неимоверный","неиссякаемый","неистовый","неистощимый","неистребимый","неисходный","неисчерпаемый","неисчислимый","немаловажный","немалый","немилосердный","немой","немыслимый","ненасытный","необоримый","необузданный","необыкновенный","необычайный","неограниченный","неодолимый","неописуемый","неопровержимый","неоспоримый","неотразимый","неоценимый","непередаваемый","непереносимый","непобедимый","неповторимый","непогрешимый","неподдельный","непоколебимый","непомерный","непоправимый","непостижимый","непревзойденный","непреоборимый","непреодолимый","непререкаемый","непримиримый","непробиваемый","непробудный","непроглядный","непролазный","непроходимый","неразрывный","нерасторжимый","несгибаемый","несказанный","неслыханный","несметный","несмолкаемый","несмываемый","несокрушимый","несравненный","нестерпимый","несусветный","неудержимый","неуемный","неуклонный","неукоснительный","неукротимый","неумеренный","неустанный","неусыпный","неутешный","неутолимый","неутомимый","нечеловеческий","нешуточный","нещадный","обильный","обложной","образцовый","оглушительный","огромный","ожесточенный","олимпийский","ослепительный","ослиный","основательный","остервенелый","острый","отборный","откровенный","открытый","отличный","отменный","отпетый","отчаянный","отъявленный","ошеломляющий","панический","патологический","первейший","первоклассный","первый","пламенный","плотный","площадной","повальный","поголовный","подавляющий","подлинный","подчеркнутый","полнейший","полный","поразительный","порядочный","последний","потрясающий","предельный","преклонный","преступный","приличный","принципиальный","прирожденный","прожженный","проливной","пронзительный","пронизывающий","прямой","пущий","пьянящий","рабский","радикальный","разгромный","раздирающий","разительный","разящий","райский","ревностный","революционный","редкий","редкостный","резкий","рекордный","решительный","рьяный","сатанинский","сверхчеловеческий","сверхъестественный","свинцовый","свирепый","седой","сердитый","серьезный","сильный","сказочно","сказочный","слепой","смертельный","смертный","сногсшибательный","собачий","совершеннейший","совершенный","сокрушительный","солидный","сплошной","стальной","стоический","стойкий","стопроцентный","страстный","страшный","строгий","строжайший","сумасшедший","суровый","существенный","сущий","твердый","телячий","титанический","тотальный","трескучий","триумфальный","тяжелый","тяжкий","убедительный","убежденный","убийственный","уважительный","удивительный","ужасающий","ужасный","умопомрачительный","уничтожающий","фанатический","фанатичный","фантастический","феноменальный","филигранный","форменный","фундаментальный","хороший","царский","цепенящий","черный","чертов","чертовский","чистый","чрезвычайный","чрезмерный","чудовищный","широкий","широкомасштабный","шквальный","штормовой","шумный","щедрый","щемящий","экстраординарный","экстремальный","ювелирный","ядреный","яркий","яростный","ярый"]
let aug = [["Протезирование","Порт для подключения", "Железный кулак","Стабилизатор клинка","Баллистический стабилизатор","Скрытый клинок","Дополнительный огнестрел в руках","Мышечный стабилизатор","Мышечный парализатор","Проект «Восхождение»","Фонарь","Проект «Паук»","Разрыватель материи","Укротитель замков","Помощник хирурга"], ["Глазные импланты","Вероятностный компьютер","Проект «Альманах»","Тактический анализатор","Проект «Фрейд»","Гоночный сопроцессор","Церебральный ускоритель","Проект «Адреналин»","Проект «Смотритель»","Проект «Пацифист»","Проект «Блэкаут»" ,"Удаленный доступ" ,"Удаленный доступ v1.2" ,"Проект «Марионетка»" ,"Баллистический компьютер" ,"Локальный криптободборщик" ,"Проект «Фрейд» v1.2" ,"Проект «Просвет»" ,"Проект «Ночь»" ,"Проект «След»" ,"Змеиный укус","Проект «Змея»"],["Протезирование ","Проект «Скороход» ","Попрыгунчик" ,"Падение ангела ","Проект «Мгновение»" ,"Проект «Тихоход» ","Сканер приближения ","Проект «Повелитель» ","Скрытый клинок","Проект «Шагоход» ","Проект «Восхождение» доп. модуль","Генератор феромонов" ],["Проект «Искра»","Радиоактивный протектор","Молниеотвод","Огнетушитель","Высокий иммунитет","Проект «Второй шанс»","Проект «Защитник»","Адреналиновый контроллер","Проект «Икар» ","Функциональный расширитель","Проект «Перехват»","Второе дыхание","Проект «Хамелеон","Активный камуфляж ","Видеокамера ","Око за око","Проект «Кокон»"]]
let count = parseInt($('.count').val());
let h = $('.hardness').val()

for (let i = 0; i < count; i++) {
  c=i+1
  x=x+'<div class="npc"> <h3 class="npc_head"> Противник №'+ c +'</h3> <div class="npc_list" style="display: none;">'
  if (h=='ez'){
    kach =["Плохой","Плохой","Плохой","Плохой","Плохой","Плохой","Хороший","Хороший","Хороший"]
  }
  else if (h=='easy'){
    kach =["Плохой","Плохой","Плохой","Плохой","Плохой","Хороший","Хороший","Хороший","Отличный"]
  }
  else if (h=='normal'){
    kach =["Плохой","Хороший","Отличный"]
  }
  else if (h=='hard'){
    kach =["Хороший","Хороший","Хороший","Отличный","Отличный"]
  }
  else if (h=='imposible'){
    kach =["Хороший","Отличный","Отличный"]
  }

  luck = randomInteger(1,100);
  if (luck>90){
    if (randomInteger(1,10)<=5){
      lis = okon (arrayRand(sus),arrayRand(pril))
      m = luck+'<p>Оружие: '+arrayRand(kach)+' '+arrayRand(gun_list).toLowerCase() +' "'+lis+'" от '+arrayRand(gun_corps)+'</p>'
    }
    else{
      lis = okon (arrayRand(sus),arrayRand(pril))
      m = luck+'<p>Оружие: '+arrayRand(kach)+' '+arrayRand(mellee_list).toLowerCase() +' "'+lis+'" от '+arrayRand(gun_corps)+'</p>'
    }
  }
  else if(luck<90){
    if (randomInteger(1,10)<=5){
      m='<p>Оружие:'+arrayRand(kach)+' '+arrayRand(gun_list)+'</p>'
    }
    else{
      m='<p>Оружие:'+arrayRand(kach)+' '+arrayRand(mellee_list)+'</p>'
    }
  }
  m = m + '<p> Навык владения данным оружием:'+randomInteger(1,5) +'</p>'
  x=x+m
  l = '<p> Аугментации:</p><ol>'
  if (h=='ez'){
    n = randomInteger(0,1)
  }
  else if (h=='easy'){
    n = randomInteger(0,2)
  }
  else if (h=='normal'){
    n = randomInteger(0,5)
  }
  else if (h=='hard'){
    n = randomInteger(1,7)
  }
  else if (h=='imposible'){
    n = randomInteger(1,10)
  }
  for (let j = 0; j < n; j++) {
    k=randomInteger(0,3)
    l=l+'<li>'+arrayRand(aug[k])+'</li>'
  }
  x=x+l+'</ol>'
  x=x+'</div></div>'
}

$('.npcgen').append(x)

}

$('body').on('click', '.npc', function() { //сделано таким образом, т.к. фильмы генерируются из списка.
  $(this).find('.npc_list').toggle()
});



function weargen() {
  $('.weargen').empty()
  let x=''
  let lis=''

  let pril_ch=["Поношенный","Форменный","Мешковатый","Набедренный","Расшитый","Траурный","Меховой","Добротный","Штатский","Модный","Рваный","Монашеский","Шерстяной","Опрятный","Нарядный","Хлопчатобумажный","Повседневный","Льняной","Мокрый","Одетый","Холщовый","Полотняный","штатскый","сменный","поношенный","мешковатый","неброский","модный","домотканый","добротный","потрепанный","измятый","полувоенный","нарядный","стильный","помятый","запасный","драный","рваный","несвежий","ветхий","сложенный","готовый","мятый","практичный","неопрятный","снятый с трупа","монашеский","праздничный","нищенский","мокрый","старомодный","выходный","неподходящий","фирменный","потёртый","гражданский","разноцветный","невзрачный","элегантный","траурный","рабочий","маскировочный","меховой","броский","верхний","грязный","матросский","тёплый","приличный","подходящый","вызывающый","повседневный","неприметный","пятнистый","крестьянский","полотняный","полосатый","дамский","будничный","походный","шерстяный","спортивный","испорченный","ковбойский","разнообразный","дорожный","пурпурный","удобный","защитный","парадный","пёстрый","цветастый","бесформенный","убогий","холщовый","непривычный","традиционный","синтетический","громоздкий","летний","остальный","джинсовый","диковинный","суконный","неудобный","ненужный","камуфляжный","богатый","тренировочный","изысканный","домашний","скромный","уличный","кожаный"]
  let сhmot=[["Рабочий комбинезон","Походный костюм","Деловой костюм","Спортивный костюм","Обноски","Почтальонский костюм","Панковские обноски","Платье"],["Кожаная курка байкера","Лабораторный халат","Майка","Рубашка","Свитер","Плащ","Майка-алкоголичка","Топ","Жилетка","Сарафан","Пижама","Туника","Пальто","Китель "],["Трусы","Штаны","Шорты","Юбка","Бриджи","Джинсы","Брюки"],["Кроссовки","Кеды","Классические туфли","Теннисные туфли","Ковбойские сапоги","Армейские сапоги","Берцы","Ботинки","Женские туфли","Мокасины"]]
  let armor=["Бандитский набор","Набор Служителя закона","Военный набор","Гражданский набор","Джентльменский набор"]
  let pril_armor=["Металлический","Тканевый","Кожанный","Пластсталевый","Пластиковый","Мусорный"]
  let chmot_corps=["Новая Готика","Забытая планета","Ахмедас","аХАЙё"]
  let colors=["Красный","Оранжевый","Желтый","Зеленый","Голубой","Синий","Фиолетовый","Коричневый","Черный","Белый","Леопардовый","Пятнистый","Дырявый","Лазурный","Лимонный","Кремовый","Ореховый","Кофейный","Розовый","Лиловый","Радужный","Лаймовый","Лососевый","Горчичный","Мандариновый","Малиновый","Медный","Оливковый","Одуванчиковый","Неоновый"]
  сhmot.forEach((chm,index) => {
    if (index==0){name = 'Костюмы'}
    if (index==1){name = 'Верх'}
    if (index==2){name = 'Низ'}
    if (index==3){name = 'Обувь'}
    x=x+'<div class="wear"> <h3 class="wear_head">'+ name +'</h3> <div class="wear_list" style="display: none;"> <ol>'
    // if (index == 0){
    //   for (let i = 0; i < 20; i++) {
    //     lis = '<li>'+arrayRand(pril_ch)+' '+arrayRand(colors).toLowerCase() +' '+arrayRand(chm).toLowerCase()+' от '+arrayRand(chmot_corps)+'</li>'
    //     x=x+lis
    //   }
    // }
    // else{
      for (let i = 0; i < 20; i++) {
        let q= okon_wear(arrayRand(chm),arrayRand(pril_ch),arrayRand(colors))
        lis = '<li>'+q+' от '+arrayRand(chmot_corps)+'</li>'
        x=x+lis
      }
    // }
    x=x+'</ol></div></div>'
  });
  $('.weargen').append(x)
}
$('body').on('click', '.wear', function() { //сделано таким образом, т.к. фильмы генерируются из списка.
  $(this).find('.wear_list').toggle()
});

function okon_wear(sus,pril,clr){
  let lek;
  let kek;
  k= sus.length
  m = pril.length
  c= clr.length
  if (sus[k-1] == "а" || sus[k-1] == "ь" || sus[k-1] == "я") {
    lek = pril.substring(0, m-2) + "aя";
    lek = lek[0].toUpperCase()+lek.substring(1,m)
  } else if (sus[k-1] == "е" || sus[k-1] == "о") {
    lek = pril.substring(0, m-2) + "ое";
    lek = lek[0].toUpperCase()+lek.substring(1,m)
  } else if (sus[k-1] == "и"|| sus[k-1] == "ы") {
    lek = pril.substring(0, m-2) + "ые";
    lek = lek[0].toUpperCase()+lek.substring(1,m)
  } else {
    lek = pril
    lek = lek[0].toUpperCase()+lek.substring(1,m)
  }
  if (sus[k-1] == "а" || sus[k-1] == "ь" || sus[k-1] == "я") {
    kek = clr.substring(0, c-2) + "aя";
  } else if (sus[k-1] == "е" || sus[k-1] == "о") {
    kek = clr.substring(0, c-2) + "ое";
  } else if (sus[k-1] == "и") {
    kek = clr.substring(0, c-2) + "ые";
  } else {
    kek = clr
  }
  l = lek +' '+kek+' '+sus
  return l;
}

function gungen() {
  $('.gungen').empty()
  let x=''
  let lis=''
  let kach =["Плохой","Хороший","Отличный"]
  let gun_corps=["ЛЕтс-ГО","Армада","European Guns"]
  let gun_list=["Пистолет","Дробовик","Винтовка","Автомат","Гранатомет","Пулемет","Шокер","Шприцемет"]
  let mellee_list=["Нож","Катана","Бита","Дилдо"]
  let sus=["год","человек","время","дело","жизнь","день","рука","раз","работа","слово","место","лицо","друг","глаз","вопрос","дом","сторона","страна","мир","случай","голова","ребенок","сила","конец","вид","система","часть","город","отношение","женщина","деньги","земля","машина","вода","отец","проблема","час","право","нога","решение","дверь","образ","история","власть","закон","война","бог","голос","тысяча","книга","возможность","результат","ночь","стол","имя","область","статья","число","компания","народ","жена","группа","развитие","процесс","суд","условие","средство","начало","свет","пора","путь","душа","уровень","форма","связь","минута","улица","вечер","качество","мысль","дорога","мать","действие","месяц","государство","язык","любовь","взгляд","мама","век","школа","цель","общество","деятельность","организация","президент","комната","порядок","момент","театр","письмо","утро","помощь","ситуация","роль","рубль","смысл","состояние","квартира","орган","внимание","тело","труд","сын","мера","смерть","рынок","программа","задача","предприятие","окно","разговор","правительство","семья","производство","информация","положение","центр","ответ","муж","автор","стена","интерес","федерация","правило","управление","мужчина","идея","партия","совет","счет","сердце","движение","вещь","материал","неделя","чувство","глава","наука","ряд","газета","причина","плечо","цена","план","речь","точка","основа","товарищ","культура","данные","мнение","документ","институт","ход","проект","встреча","директор","срок","палец","опыт","служба","судьба","девушка","очередь","лес","состав","член","количество","событие","объект","зал","создание","значение","период","шаг","брат","искусство","структура","номер","пример","исследование","гражданин","игра","начальник","рост","тема","принцип","метод","тип","фильм","край","гость","воздух","характер","борьба","использование","размер","образование","мальчик","кровь","район","небо","армия","класс","представитель","участие","девочка","политика","герой","картина","доллар","спина","территория","пол","поле","изменение","направление","рисунок","течение","церковь","банк","сцена","население","большинство","музыка","правда","свобода","память","команда","союз","врач","договор","дерево","факт","хозяин","природа","угол","телефон","позиция","двор","писатель","самолет","объем","род","солнце","вера","берег","спектакль","фирма","способ","завод","цвет","журнал","руководитель","специалист","оценка","регион","песня","процент","родитель","море","требование","основание","половина","роман","круг","анализ","стихи","автомобиль","экономика","литература","бумага","поэт","степень","господин","надежда","предмет","вариант","министр","граница","дух","модель","операция","пара","сон","название","ум","повод","старик","миллион","успех","счастье","ребята","кабинет","магазин","пространство","выход","удар","база","знание","текст","защита","руководство","площадь","сознание","возраст","участник","участок","пункт","линия","желание","папа","доктор","губа","дочь","среда","председатель","представление","солдат","художник","волос","оружие","соответствие","ветер","парень","зрение","генерал","огонь","понятие","строительство","ухо","грудь","нос","страх","услуга","содержание","радость","безопасность","продукт","комплекс","бизнес","сад","сотрудник","лето","курс","предложение","рот","технология","реформа","отсутствие","собака","камень","будущее","рассказ","контроль","река","продукция","сумма","техника","здание","сфера","необходимость","фонд","подготовка","лист","республика","хозяйство","воля","бюджет","снег","деревня","мужик","элемент","обстоятельство","немец","победа","источник","звезда","выбор","масса","итог","сестра","практика","проведение","карман","слава","кухня","определение","функция","войско","комиссия","применение","капитан","работник","обеспечение","офицер","фамилия","предел","выборы","ученый","бутылка","бой","теория","зона","отдел","зуб","разработка","личность","гора","товар","метр","праздник","влияние","читатель","удовольствие","актер","слеза","ответственность","учитель","акт","боль","множество","особенность","показатель","корабль","звук","впечатление","частность","детство","вывод","профессор","доля","норма","прошлое","командир","коридор","поддержка","рамка","враг","этап","черт","дед","собрание","прием","болезнь","клетка","кожа","заявление","попытка","сравнение","расчет","депутат","комитет","знак","дядя","учет","хлеб","чай","режим","целое","вирус","выражение","здоровье","зима","десяток","глубина","сеть","студент","секунда","скорость","поиск","суть","налог","ошибка","доход","режиссер","поверхность","ощущение","карта","клуб","станция","революция","колено","министерство","стекло","этаж","высота","бабушка","трубка","газ","мастер","поведение","столица","механизм","передача","способность","подход","энергия","существование","исполнение","кино","сожаление","заместитель","ресурс","акция","рождение","администрация","стоимость","улыбка","артист","сосед","фраза","фигура","субъект","реакция","список","фотография","журналист","май","нарушение","заседание","толпа","больница","существо","свойство","долг","поколение","животное","схема","усилие","отличие","остров","противник","волна","реализация","страница","формирование","житель","красота","птица","растение","тень","явление","храм","запах","водка","наличие","ужас","одежда","кресло","больной","поезд","университет","традиция","адрес","декабрь","ладонь","сведение","цветок","лидер","октябрь","занятие","сентябрь","помещение","январь","зритель","редакция","стиль","весна","фактор","август","известие","зависимость","охрана","оборудование","концерт","отделение","расход","выставка","милиция","переход","эпоха","запад","произведение","родина","собственность","тайна","трава","лагерь","имущество","кровать","аппарат","середина","март","клиент","дама","фронт","отрасль","стул","беседа","законодательство","продажа","повышение","музей","след","полковник","сомнение","понимание","апрель","князь","рыба","дума","кодекс","сутки","чудо","шея","судья","крыша","настроение","поток","должность","преступление","мозг","честь","пост","еврей","июнь","сотня","дождь","лестница","дача","установка","появление","получение","образец","труба","главное","осень","костюм","баба","ценность","обязанность","пьеса","таблица","вино","воспоминание","лошадь","коллега","организм","ученик","учреждение","открытие","том","черта","характеристика","выполнение","оборона","выступление","температура","перспектива","подруга","приказ","жертва","ресторан","километр","спор","вкус","признак","промышленность","американец","лоб","заключение","восток","исключение","ключ","постановление","слой","бок","июль","перевод","секретарь","кусок","слух","польза","звонок","обстановка","чиновник","соглашение","деталь","русский","тишина","зарплата","билет","подарок","тюрьма","ящик","конкурс","книжка","изучение","просьба","царь","публика","смех","сообщение","угроза","беда","блок","достижение","назначение","реклама","портрет","масло","стакан","урок","часы","крик","творчество","телевизор","инструмент","концепция","лейтенант","экран","дно","реальность","канал","мясо","знакомый","щека","конфликт","переговоры","запись","вагон","площадка","последствие","сотрудничество","зеркало","тон","академия","палата","потребность","ноябрь","увеличение","дурак","поездка","обед","потеря","февраль","мероприятие","парк","принятие","устройство","вещество","категория","сезон","гостиница","издание","объединение","темнота","человечество","колесо","опасность","разрешение","воздействие","коллектив","камера","запас","следствие","длина","крыло","округ","фон","кандидат","родственник","давление","присутствие","взаимодействие","доска","партнер","двигатель","шум","достоинство","грех","нож","полет","страсть","испытание","TRUE","оплата","разница","водитель","пакет","снижение","формула","живот","капитал","мост","новость","эффект","вход","губернатор","доклад","смена","убийство","эксперт","автобус","платье","кадр","тетя","общение","психология","лев","порог","проверка","процедура","рабочий","ремонт","обращение","обучение","ожидание","памятник","корень","наблюдение","буква","доказательство","признание","постель","штаб","владелец","компьютер","инженер","старуха","лодка","ракета","серия","шутка","вершина","выпуск","кулак","лед","торговля","нефть","молодежь","цифра","корпус","недостаток","сапог","сущность","талант","эффективность","кофе","полоса","основное","рассмотрение","сбор","штат","следователь","жилье","мешок","описание","куст","отказ","замок","редактор","дворец","забота","пиво","диван","столик","эксперимент","печать","кольцо","пистолет","воспитание","начальство","профессия","ворота","добро","дружба","покой","риск","окончание","дым","брак","величина","записка","инициатива","совесть","активность","кость","спорт","кредит","господь","майор","конференция","потолок","библиотека","помощник","конструкция","отдых","ручка","металл","молоко","прокурор","транспорт","поэзия","соединение","краска","расстояние","мечта","село","еда","зло","подразделение","сюжет","рубеж","сигнал","атмосфера","крест","вес","взрыв","контакт","сигарета","восторг","золото","почва","премия","король","подъезд","шанс","автомат","заказ","мальчишка","очки","миг","штука","чтение","поселок","свидетель","ставка","сумка","удивление","хвост","песок","поворот","возвращение","мгновение","статус","озеро","строй","параметр","сказка","тенденция","вина","дыхание","версия","масштаб","монастырь","хозяйка","дочка","танец","эксплуатация","коммунист","пенсия","приятель","объяснение","набор","производитель","пыль","философия","мощность","обязательство","уход","горло","кризис","указание","плата","яблоко","препарат","действительность","москвич","остаток","изображение","сделка","сочинение","покупатель","танк","затрата","строка","единица","обработка","чемпионат"]
  let pril=["абсолютный","адский","азартный","активный","ангельский","антагонистический","арктический","астрономический","баснословный","безапелляционный","безбожный","безбрежный","безвозвратный","безграничный","бездонный","бездушный","безжалостный","беззаветный","беззастенчивый","безмерный","безмятежный","безнадежный","безоговорочный","безотлагательный","безраздельный","безрассудный","безропотный","безудержный","безукоризненный","безумный","безупречный","безусловный","безустанный","безутешный","безысходный","белоснежный","бескомпромиссный","бесконечный","беспардонный","бесповоротный","беспощадный","беспредельный","беспрекословный","беспрецедентный","беспримерный","беспробудный","беспроглядный","беспросветный","беспросыпный","бессовестный","бесстыдный","бесценный","бесчеловечный","бесчисленный","бесшабашный","бешеный","блестящий","богатый","богатырский","большой","буйный","бурный","варварский","великий","величайший","веский","весомый","внушительный","возмутительный","волчий","вопиющий","восторженный","впечатляющий","всемерный","всепоглощающий","всесильный","всесторонний","всяческий","выдающийся","вылитый","высокий","высший","галопирующий","гибельный","гигантский","глубокий","глубочайший","глухой","головокружительный","гомерический","горький","горючий","горячий","грандиозный","гробовой","грозный","громадный","громкий","громоподобный","грубый","густой","диаметральный","дивный","дикий","добрый","доскональный","дотошный","дремучий","душераздирающий","дьявольский","жаркий","жгучий","железный","жесткий","жестокий","жесточайший","живой","животный","жизненный","жуткий","завзятый","завидный","закадычный","заклятый","законченный","закоренелый","замечательно","замечательный","записной","запредельный","заядлый","звериный","зверский","зеленый","злой","злостный","значительный","идеальный","излишний","изрядный","изуверский","изумительный","исключительный","исполинский","исступленный","истинно","истинный","истовый","истошный","исчерпывающий","каменный","кардинальный","катастрофический","категорический","клятвенный","колоссальный","коренной","космический","крайний","крепкий","кристальный","кричащий","кровный","кромешный","круглый","крупный","крутой","леденящий","лошадиный","лютый","максимальный","массовый","маститый","матерый","махровый","мертвенный","мертвецкий","мертвый","мировой","могильный","могучий","молниеносный","мощный","мучительный","набитый","наглый","наглядный","надежный","надрывный","наибольший","наивысший","нарочитый","настоятельный","настоящий","насущный","небывалый","невероятный","невиданный","невозможный","невообразимый","невосполнимый","невыносимый","невыразимый","недопустимый","недосягаемый","недюжинный","незабываемый","незаурядный","неземной","неизбывный","неизмеримый","неимоверный","неиссякаемый","неистовый","неистощимый","неистребимый","неисходный","неисчерпаемый","неисчислимый","немаловажный","немалый","немилосердный","немой","немыслимый","ненасытный","необоримый","необузданный","необыкновенный","необычайный","неограниченный","неодолимый","неописуемый","неопровержимый","неоспоримый","неотразимый","неоценимый","непередаваемый","непереносимый","непобедимый","неповторимый","непогрешимый","неподдельный","непоколебимый","непомерный","непоправимый","непостижимый","непревзойденный","непреоборимый","непреодолимый","непререкаемый","непримиримый","непробиваемый","непробудный","непроглядный","непролазный","непроходимый","неразрывный","нерасторжимый","несгибаемый","несказанный","неслыханный","несметный","несмолкаемый","несмываемый","несокрушимый","несравненный","нестерпимый","несусветный","неудержимый","неуемный","неуклонный","неукоснительный","неукротимый","неумеренный","неустанный","неусыпный","неутешный","неутолимый","неутомимый","нечеловеческий","нешуточный","нещадный","обильный","обложной","образцовый","оглушительный","огромный","ожесточенный","олимпийский","ослепительный","ослиный","основательный","остервенелый","острый","отборный","откровенный","открытый","отличный","отменный","отпетый","отчаянный","отъявленный","ошеломляющий","панический","патологический","первейший","первоклассный","первый","пламенный","плотный","площадной","повальный","поголовный","подавляющий","подлинный","подчеркнутый","полнейший","полный","поразительный","порядочный","последний","потрясающий","предельный","преклонный","преступный","приличный","принципиальный","прирожденный","прожженный","проливной","пронзительный","пронизывающий","прямой","пущий","пьянящий","рабский","радикальный","разгромный","раздирающий","разительный","разящий","райский","ревностный","революционный","редкий","редкостный","резкий","рекордный","решительный","рьяный","сатанинский","сверхчеловеческий","сверхъестественный","свинцовый","свирепый","седой","сердитый","серьезный","сильный","сказочно","сказочный","слепой","смертельный","смертный","сногсшибательный","собачий","совершеннейший","совершенный","сокрушительный","солидный","сплошной","стальной","стоический","стойкий","стопроцентный","страстный","страшный","строгий","строжайший","сумасшедший","суровый","существенный","сущий","твердый","телячий","титанический","тотальный","трескучий","триумфальный","тяжелый","тяжкий","убедительный","убежденный","убийственный","уважительный","удивительный","ужасающий","ужасный","умопомрачительный","уничтожающий","фанатический","фанатичный","фантастический","феноменальный","филигранный","форменный","фундаментальный","хороший","царский","цепенящий","черный","чертов","чертовский","чистый","чрезвычайный","чрезмерный","чудовищный","широкий","широкомасштабный","шквальный","штормовой","шумный","щедрый","щемящий","экстраординарный","экстремальный","ювелирный","ядреный","яркий","яростный","ярый"]
  gun_list.forEach((chm,index) => {
    x=x+'<div class="gun"> <h3 class="gun_head">'+ chm +'</h3> <div class="gun_list" style="display: none;"> <ol>'
    for (let i = 0; i < 20; i++) {
      m = okon (arrayRand(sus),arrayRand(pril))
      lis = '<li>'+arrayRand(kach)+' '+chm.toLowerCase() +' "'+m+'" от '+arrayRand(gun_corps)+'</li>'
      x=x+lis
    }
    x=x+'</ol></div></div>'
  });
  $('.gungen').append(x)
  mellee_list.forEach((chm,index) => {
    x=x+'<div class="gun"> <h3 class="gun_head">'+ chm +'</h3> <div class="gun_list" style="display: none;"> <ol>'
    for (let i = 0; i < 20; i++) {
      m = okon (arrayRand(sus),arrayRand(pril))
      lis = '<li>'+arrayRand(kach)+' '+chm.toLowerCase() +' "'+m+'" от '+arrayRand(gun_corps)+'</li>'
      x=x+lis
    }
    x=x+'</ol></div></div>'
  });
  $('.gungen').append(x)

}
$('body').on('click', '.gun', function() { //сделано таким образом, т.к. фильмы генерируются из списка.
  $(this).find('.gun_list').toggle()
});



function okon(sus,pril){
  let lek;
  k= sus.length
  m = pril.length
  if (sus[k-1] == "а" || sus[k-1] == "ь" || sus[k-1] == "я") {
    lek = pril.substring(0, m-2) + "aя";
    l = lek + ' '+ sus;
  } else if (sus[k-1] == "е" || sus[k-1] == "о") {
    lek = pril.substring(0, m-2) + "ое";
    l = lek + ' '+ sus;
  } else if (sus[k-1] == "и") {
    lek = pril.substring(0, m-2) + "ие";
  l = lek + ' '+ sus;
  } else {
    l = pril + ' '+ sus;
  }
  return l;
}
